tap "heroku/brew"
brew "automake"
brew "bat"
brew "boost"
brew "gmp"
brew "coreutils"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "irssi"
brew "jq"
brew "libomp"
brew "libxml2"
brew "libxslt"
brew "pipx"
brew "poppler"
brew "postgresql@14"
brew "postgresql@15", restart_service: :changed
brew "python@3.12"
brew "python@3.13"
brew "railway"
brew "ruby-build"
brew "rbenv"
brew "terminal-notifier"
brew "texlive"
brew "heroku/brew/heroku"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "tomoki1207.pdf"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "zhuangtongfa.material-theme"
