eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
openai.chatgpt
redhat.java
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
tomoki1207.pdf
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
zhuangtongfa.material-theme
